junkreef/F280025C_LP_IndependentStudy_DRV8434S/F280025C_LP_IndependentStudy_DRV8434S/driverlib/pin_map.h
#define GPIO_31_GPIO31                  0x00081E00U
#define GPIO_31_CANA_TX                 0x00081E01U
#define GPIO_31_SPIB_SOMI               0x00081E03U
#define GPIO_31_OUTPUTXBAR8             0x00081E05U
#define GPIO_31_EQEP1_INDEX             0x00081E06U
#define GPIO_31_FSIRXA_D1               0x00081E09U
#define GPIO_31_EPWM1_B                 0x00081E0BU
#define GPIO_31_HIC_D10                 0x00081E0EU

#define GPIO_32_GPIO32                  0x00460000U
#define GPIO_32_I2CA_SDA                0x00460001U
#define GPIO_32_SPIB_CLK                0x00460003U
#define GPIO_32_LINA_TX                 0x00460006U
#define GPIO_32_FSIRXA_D0               0x00460009U
#define GPIO_32_CANA_TX                 0x0046000AU
#define GPIO_32_ADCSOCBO                0x0046000DU
#define GPIO_32_HIC_INT                 0x0046000FU

#define GPIO_33_GPIO33                  0x00460200U
#define GPIO_33_I2CA_SCL                0x00460201U
#define GPIO_33_SPIB_STE                0x00460203U
#define GPIO_33_OUTPUTXBAR4             0x00460205U
#define GPIO_33_LINA_RX                 0x00460206U
#define GPIO_33_FSIRXA_CLK              0x00460209U
#define GPIO_33_CANA_RX                 0x0046020AU
#define GPIO_33_EQEP2_B                 0x0046020BU
#define GPIO_33_ADCSOCAO                0x0046020DU
#define GPIO_33_HIC_D0                  0x0046020FU

#define GPIO_34_GPIO34                  0x00460400U
#define GPIO_34_OUTPUTXBAR1             0x00460401U
#define GPIO_34_PMBUSA_SDA              0x00460406U
#define GPIO_34_HIC_NBE1                0x0046040DU
#define GPIO_34_I2CB_SDA                0x0046040EU
#define GPIO_34_HIC_D9                  0x0046040FU

#define GPIO_35_GPIO35                  0x00460600U
#define GPIO_35_SCIA_RX                 0x00460601U
#define GPIO_35_I2CA_SDA                0x00460603U
#define GPIO_35_CANA_RX                 0x00460605U
#define GPIO_35_PMBUSA_SCL              0x00460606U
#define GPIO_35_LINA_RX                 0x00460607U
#define GPIO_35_EQEP1_A                 0x00460609U
#define GPIO_35_PMBUSA_CTL              0x0046060AU
#define GPIO_35_HIC_NWE                 0x0046060EU
#define GPIO_35_TDI                     0x0046060FU

#define GPIO_37_GPIO37                  0x00460A00U
#define GPIO_37_OUTPUTXBAR2             0x00460A01U
#define GPIO_37_I2CA_SCL                0x00460A03U
#define GPIO_37_SCIA_TX                 0x00460A05U
#define GPIO_37_CANA_TX                 0x00460A06U
#define GPIO_37_LINA_TX                 0x00460A07U
#define GPIO_37_EQEP1_B                 0x00460A09U
#define GPIO_37_PMBUSA_ALERT            0x00460A0AU
#define GPIO_37_HIC_NRDY                0x00460A0EU
#define GPIO_37_TDO                     0x00460A0FU

#define GPIO_39_GPIO39                  0x00460E00U
#define GPIO_39_FSIRXA_CLK              0x00460E07U
#define GPIO_39_EQEP2_INDEX             0x00460E09U
#define GPIO_39_CLB_OUTPUTXBAR2         0x00460E0BU
#define GPIO_39_SYNCOUT                 0x00460E0DU
#define GPIO_39_EQEP1_INDEX             0x00460E0EU
#define GPIO_39_HIC_D7                  0x00460E0FU

#define GPIO_40_GPIO40                  0x00461000U
#define GPIO_40_SPIB_SIMO               0x00461001U
#define GPIO_40_EPWM2_B                 0x00461005U
#define GPIO_40_PMBUSA_SDA              0x00461006U
#define GPIO_40_FSIRXA_D0               0x00461007U
#define GPIO_40_EQEP1_A                 0x0046100AU
#define GPIO_40_LINB_TX                 0x0046100BU
#define GPIO_40_HIC_NBE1                0x0046100EU
#define GPIO_40_HIC_D5                  0x0046100FU

#define GPIO_41_GPIO41                  0x00461200U
#define GPIO_41_EPWM2_A                 0x00461205U
#define GPIO_41_PMBUSA_SCL              0x00461206U
#define GPIO_41_FSIRXA_D1               0x00461207U
#define GPIO_41_EQEP1_B                 0x0046120AU
#define GPIO_41_LINB_RX                 0x0046120BU
#define GPIO_41_HIC_A4                  0x0046120DU
#define GPIO_41_SPIB_SOMI               0x0046120EU
#define GPIO_41_HIC_D12                 0x0046120FU

#define GPIO_42_GPIO42                  0x00461400U
#define GPIO_42_LINA_RX                 0x00461402U
#define GPIO_42_OUTPUTXBAR5             0x00461403U
#define GPIO_42_PMBUSA_CTL              0x00461405U
#define GPIO_42_I2CA_SDA                0x00461406U
#define GPIO_42_EQEP1_STROBE            0x0046140AU
#define GPIO_42_CLB_OUTPUTXBAR3         0x0046140BU
#define GPIO_42_HIC_D2                  0x0046140EU
#define GPIO_42_HIC_A6                  0x0046140FU

#define GPIO_43_GPIO43                  0x00461600U
#define GPIO_43_OUTPUTXBAR6             0x00461603U
#define GPIO_43_PMBUSA_ALERT            0x00461605U
#define GPIO_43_I2CA_SCL                0x00461606U
#define GPIO_43_EQEP1_INDEX             0x0046160AU
#define GPIO_43_CLB_OUTPUTXBAR4         0x0046160BU
#define GPIO_43_HIC_D3                  0x0046160EU
#define GPIO_43_HIC_A7                  0x0046160FU

#define GPIO_44_GPIO44                  0x00461800U
#define GPIO_44_OUTPUTXBAR7             0x00461803U
#define GPIO_44_EQEP1_A                 0x00461805U
#define GPIO_44_FSITXA_CLK              0x00461807U
#define GPIO_44_CLB_OUTPUTXBAR3         0x0046180AU
#define GPIO_44_HIC_D7                  0x0046180DU
#define GPIO_44_HIC_D5                  0x0046180FU

#define GPIO_45_GPIO45                  0x00461A00U
#define GPIO_45_OUTPUTXBAR8             0x00461A03U
#define GPIO_45_FSITXA_D0               0x00461A07U
#define GPIO_45_CLB_OUTPUTXBAR4         0x00461A0AU
#define GPIO_45_HIC_D6                  0x00461A0FU

#define GPIO_46_GPIO46                  0x00461C00U
#define GPIO_46_LINA_TX                 0x00461C03U
#define GPIO_46_FSITXA_D1               0x00461C07U
#define GPIO_46_HIC_NWE                 0x00461C0FU

#define GPIO_61_GPIO61                  0x00481A00U

#define GPIO_62_GPIO62                  0x00481C00U

#define GPIO_63_GPIO63                  0x00481E00U

#define GPIO_224_GPIO224                0x01C60000U
#define GPIO_224_HIC_A3                 0x01C6000FU

#define GPIO_225_GPIO225                0x01C60200U
#define GPIO_225_HIC_NWE                0x01C6020FU

#define GPIO_226_GPIO226                0x01C60400U
#define GPIO_226_HIC_A1                 0x01C6040FU

#define GPIO_227_GPIO227                0x01C60600U
#define GPIO_227_HIC_NBE0               0x01C6060FU

#define GPIO_228_GPIO228                0x01C60800U
#define GPIO_228_HIC_A0                 0x01C6080FU

#define GPIO_230_GPIO230                0x01C60C00U
#define GPIO_230_HIC_BASESEL2           0x01C60C0FU

#define GPIO_231_GPIO231                0x01C60E00U
#define GPIO_231_HIC_BASESEL1           0x01C60E0FU

#define GPIO_232_GPIO232                0x01C61000U
#define GPIO_232_HIC_BASESEL0           0x01C6100FU

#define GPIO_233_GPIO233                0x01C61200U
#define GPIO_233_HIC_A4                 0x01C6120FU

#define GPIO_237_GPIO237                0x01C61A00U
#define GPIO_237_HIC_A6                 0x01C61A0FU

#define GPIO_238_GPIO238                0x01C61C00U
#define GPIO_238_HIC_NCS                0x01C61C0FU

#define GPIO_239_GPIO239                0x01C61E00U
#define GPIO_239_HIC_A5                 0x01C61E0FU

#define GPIO_241_GPIO241                0x01C80200U
#define GPIO_241_HIC_NBE1               0x01C8020FU

#define GPIO_242_GPIO242                0x01C80400U
#define GPIO_242_HIC_A2                 0x01C8040FU

#define GPIO_244_GPIO244                0x01C80800U
#define GPIO_244_HIC_A7                 0x01C8080FU

#define GPIO_245_GPIO245                0x01C80A00U
#define GPIO_245_HIC_NOE                0x01C80A0FU

#endif // PIN_MAP_H
